unit uLocalize;

interface
uses
  uConsts;

function lcS(AStringId: String; ASchemaType: TSchemaType): String;

implementation
uses uLocalizeShared;


function lcS(AStringId: String; ASchemaType: TSchemaType): String;
begin
  case ASchemaType of
    stStar: Result := lc(AStringId+'_Star');
    stTriangle: Result := lc(AStringId+'_Triangle');
  end;
end;

initialization

  vUkrList.Values['MainSchema'] := 'Намалюємо схему трьохфазного з''єднання згідно умови задачі';
  vRusList.Values['MainSchema'] := 'Нарисуем схему трехфазного соединения согласно условию задачи';

  vUkrList.Values['Start_Star'] := 'Розрахунок схеми "Зірка":';
  vRusList.Values['Start_Star'] := 'Рассчет схемы "Звезда":';

  vUkrList.Values['Start_Triangle'] := 'Розрахунок схеми "Трикутник":';
  vRusList.Values['Start_Triangle'] := 'Рассчет схемы "Треугольник":';

  vUkrList.Values['PrepareX#1'] := 'Циклічна частота змінної напруги';
  vRusList.Values['PrepareX#1'] := 'Циклическая частота переменного тока';

  vUkrList.Values['PrepareX#2'] := 'Визначимо опори катушок індуктивності та конденсаторів.';
  vRusList.Values['PrepareX#2'] := 'Определим сопротивления катушек индуктивности и конденсаторов.';

  vUkrList.Values['CalcUf#1_Faz'] := 'Фазна напруга визначається як';
  vRusList.Values['CalcUf#1_Faz'] := 'Фазное напряжение определяется как ';
  vUkrList.Values['CalcUf#1_Lin'] := 'Лінійна напруга визначається як';
  vRusList.Values['CalcUf#1_Lin'] := 'линейное напряжение определяется как ';


{  vUkrList.Values['CalcUf#2'] := 'Де ';
  vRusList.Values['CalcUf#2'] := 'Где ';
  vUkrList.Values['CalcUf#3'] := ' - лінійна напруга';
  vRusList.Values['CalcUf#3'] := ' - линейное напряжение';}


  vUkrList.Values['Module1#1'] := 'Для розрахунку кола будемо використовувати символічний метод.';
  vRusList.Values['Module1#1'] := 'Для расчета цепи будем использовать символический метод.';

  vUkrList.Values['Module1#2_Star'] := 'При з''єднанні фаз споживачів "зіркою" і наявності нейтрального проводу з нульовим опором  фазні напруги дорівнюють відповідним напругам на фазах джерела:';
  vRusList.Values['Module1#2_Star'] := 'При соединении фаз потребителей "звездой" и наличии нейтрального провода з нулевым сопротивлением фазные напряжения равны соответствующим напряжениям на фазах источника:';
  vUkrList.Values['Module1#2_Triangle'] := 'При з''єднанні фаз споживачів "трикутником" фазні напруги рівні лінійним напругам.';
  vRusList.Values['Module1#2_Triangle'] := 'При соединении фаз потребителей "треугольником" фазные напряжения равны линейным напряжениям.';

  vUkrList.Values['Module1#3'] := 'В комплексному вигляді:';
  vRusList.Values['Module1#3'] := 'В комплексном виде:';

  vUkrList.Values['Module2#1'] := 'Запишемо комплексні опори фаз приймача:';
  vRusList.Values['Module2#1'] := 'Запишем комплексные сопротивления фаз приемника:';
  vUkrList.Values['Module2#1S'] := 'Повні опори кожної фази:';
  vRusList.Values['Module2#1S'] := 'Полное сопротивление каждой фазы:';


  vUkrList.Values['Module3#1'] := 'Визначимо кути зсуву фаз між фазними напругами та струмом:';
  vRusList.Values['Module3#1'] := 'Определим углы смещения фаз между фазными напряжениями и током:';

  vUkrList.Values['Module3#2']  := 'Як бачимо, ';
  vRusList.Values['Module3#2']  := 'Как видим, ';

  vUkrList.Values['Module3#2>0'] := ', тому навантаження фази має активно-індуктивний характер';
  vRusList.Values['Module3#2>0'] := ', поэтому нагрузка фазы имеет активно-индуктивных характер';
  vUkrList.Values['Module3#2_0'] := ', тому навантаження фази має активний (омічний) характер';
  vRusList.Values['Module3#2_0'] := ', поэтому нагрузка фазы имеет активный (омический) характер';
  vUkrList.Values['Module3#2<0'] := ', тому навантаження фази має активно-ємнісний характер';
  vRusList.Values['Module3#2<0'] := ', поэтому нагрузка фазы имеет активно-ёмкостный характер';
  vUkrList.Values['Module3#2_90'] := ', тому навантаження фази має реактивний (індуктивний) характер';
  vRusList.Values['Module3#2_90'] := ', поэтому нагрузка фазы имеет реактивный (индуктивный) характер';
  vUkrList.Values['Module3#2_-90'] := ', тому навантаження фази має реактивний (ємнісний) характер';
  vRusList.Values['Module3#2_-90'] := ', поэтому нагрузка фазы имеет реактивный (ёмкостный) характер';

  vUkrList.Values['Module4#1']  := 'Розрахуємо комплекси діючих значень фазних струмів ';
  vRusList.Values['Module4#1']  := 'Рассчитаем комплексы действующих значений фазных токов';
  vUkrList.Values['Module4#1_Star']  := ' (вони є і лінійними струмами)';
  vRusList.Values['Module4#1_Star']  := ' (они являются и линейными токами)';
  vUkrList.Values['Module4#2']  := 'Розрахуємо комплекси діючих значень лінійних струмів ';
  vRusList.Values['Module4#2']  := 'Рассчитаем комплексы действующих значений линейных токов';
  vUkrList.Values['Module4#1S']  := 'Знайдемо діючі значення фазних струмів: ';
  vRusList.Values['Module4#1S']  := 'Найдем действующие значения фазных токов: ';


  vUkrList.Values['Module4#3']  := 'Розрахуємо струм у нульовому (нейтральному) провіднику:';
  vRusList.Values['Module4#3']  := 'Рассчитаем ток в нулевом (нейтральном) проводнике:';

  vUkrList.Values['Module5#1']  := 'Розрахуємо баланс потужностей. '#13#10+'Потужність фаз генератора:';
  vRusList.Values['Module5#1']  := 'Рассчитаем баланс мощностей. '#13#10+ 'Мощность фаз генератора';

  vUkrList.Values['Module5#1S']  := 'Знайдемо активну (P), реактивну (Q) та повну (S) потужність кожної фази';
  vRusList.Values['Module5#1S']  := 'Найдём активную (P), реактивную (Q) и полную (S) мощность каждой фазы';


  vUkrList.Values['Module5#2']  := 'де ';
  vRusList.Values['Module5#2']  := 'где ';
  vUkrList.Values['Module5#3']  := ' - величина, що комплексно спряжена до даної сили струму ';
  vRusList.Values['Module5#3']  := ' - величина, комплексно сопряженная к данной силе тока  ';
  vUkrList.Values['Module5#4']  := 'Активна потужність ';
  vRusList.Values['Module5#4']  := 'Активная мощность';
  vUkrList.Values['Module5#5']  := 'Реактивна потужність ';
  vRusList.Values['Module5#5']  := 'Реактивная мощность';

  vUkrList.Values['Module5#6']  := 'Потужність усіх фаз:';
  vRusList.Values['Module5#6']  := 'Мощность всех фаз:';

  vUkrList.Values['Module5#7']  := 'Потужності, що споживаються навантаженням на фазах, знайдемо за формулами:';
  vRusList.Values['Module5#7']  := 'Мощности, которые потребляются нагрузкой на фазах, найдем по формулам:';
  vUkrList.Values['Module5#8']  := 'Активна потужність';
  vRusList.Values['Module5#8']  := 'Активная мощность';
  vUkrList.Values['Module5#9']  := 'Реактивна потужність';
  vRusList.Values['Module5#9']  := 'Реактивная мощность';
  vUkrList.Values['Module5#99']  := 'Повна потужність';
  vRusList.Values['Module5#99']  := 'Полная мощность';

  vUkrList.Values['Module5#7S']  := 'Ці самі потужності визначимо по іншим формулам';
  vRusList.Values['Module5#7S']  := 'Эти же самые мощности вычислим по другим формулам';


  vUkrList.Values['Module5#10']  := 'Баланс потужностей сходиться, отже задача розв''язана вірно';
  vRusList.Values['Module5#10']  := 'Баланс мощностей сходится, следовательно, задача решена верно';

  vUkrList.Values['Diagram#1'] := 'Побудуємо векторно-топологічну діаграму напруг і струмів кола';
  vRusList.Values['Diagram#1'] := 'Построим векторно-топологическую диаграмму напряжений и токов цепи';

  vUkrList.Values['Task'] := 'Знайти:';
  vRusList.Values['Task'] := 'Найти:';

  vUkrList.Values['S'] := 'Повна потужнiсть ';
  vRusList.Values['S'] := 'Полная мощность ';

  vUkrList.Values['Y#1'] := 'Провідність фаз';
  vRusList.Values['Y#1'] := 'Проводимость фаз';

  vUkrList.Values['U0#1'] := 'Напруга зміщення нейтралі при наявності нульового дрота';
  vRusList.Values['U0#1'] := 'Напряжение смещения нейтрали при наличии нулевого провода';

  vUkrList.Values['U0#2'] := 'Напруга на фазах споживача';
  vRusList.Values['U0#2'] := 'Напряжение на фазах потребителя';


  vUkrList.Values['BadR0#1'] := 'При короткому замиканні фази "%S" і обриві нульвого проводу опір цієї фази стає рівним нулю: <formula>Z_%s=0</formula>, а її провідність рівна безмежності: <formula>Y_%s=INF</formula>';
  vRusList.Values['BadR0#1'] := 'При коротком замыкании фазы "%S" и обрыве нулевого провода сопротивление этой фазы становится равным нулю: <formula>Z_%s=0</formula>, а её проводимость равна бесконечности: <formula>Y_%s=INF</formula>';

  vUkrList.Values['BadR0#2'] := 'Напруга на цій фазі рівна нулю <formula>Points(U_%s)=0</formula>. Кінець вектора напруги зміщення нульової нейтралі зміщується в точку "%S" на векторній діаграмі.';
  vRusList.Values['BadR0#2'] := 'Напряжение на этой фазе равно нулю <formula>Points(U_%s)=0</formula>. Конец вектора напряжения смещения нулевой нейтрали смещается в точку "%S" на векторной диаграмме.';

  vUkrList.Values['BadR0#3'] := 'Дійсно, напруга зміщення нульової нейтралі визначається:';
  vRusList.Values['BadR0#3'] := 'Действительно, напряжение смещения нулевой нейтрали определяется:';

  vUkrList.Values['BadR0#4'] := 'Таким чином, при короткому замиканні фази "%S" лінійний провід цієї фази підводиться безпосередньо до нульової точки навантаження.';
  vRusList.Values['BadR0#4'] := 'Таким образом, при коротком замыкании фазы "%S" линейный провод этой фазы подводится непосредственно к нулевой точки нагрузки.';

  vUkrList.Values['BadR0#1_1'] := 'Фазні напруги приймачів:';
  vRusList.Values['BadR0#1_1'] := 'Фазные напряжения потребителей:';

  vUkrList.Values['BadR0#4_1'] := 'Струм короткозамкнутої фази визначається із закону Кірхгофа:';
  vRusList.Values['BadR0#4_1'] := 'Ток короткозамкнутой фазы определяется по закону Кирхгофа:';


  vUkrList.Values['BadRInf#1'] := 'При обриві лінійного проводу фази "%S" вона переходить у високоемпедансний стан, тобто опір фази «%S» стає рівним безмежності: <formula>Z_%s=INF</formula>, а струм у фазі "%S" рівний нулю: <formula>I_%S=0</formula>. '+
                                'Струми в двох інших фазах залишаються такими ж, як і до обриву фази "%S" внаслідок того, що фазні напруги не змінюються';
  vRusList.Values['BadRInf#1'] := 'При обрыве линейного провода фазы "%S" она переходит в высокоимпедансное состояние, тоесть сопротивление фазы «%S» становится равным бесконечности: <formula>Z_%s=INF</formula>, а ток в фазе "%S" равным нулю: <formula>I_%S=0</formula>. '+
                                'Токи в двух других фазах остаются такими же как до обрыва фазы "%S" вследствие того, что фазные напряжения не изменяются';

  vUkrList.Values['BadRInf_Tr#1'] := 'При обриві фази "%S" опір її стає рівним безмежності: <formula>Z_%S=INF</formula>, отже, струм у ній рівний нулю: <formula>I_%S=0</formula>. '+
                                    'Струми в двох інших фазах залишаються такими ж, як і до обриву фази "%S" внаслідок того, що лінійні, а отже і фазні напруги не змінюються';
  vRusList.Values['BadRInf_Tr#1'] := 'При обрыве фазы "%S" её сопротивление становится равным бесконечности: <formula>Z_%S=INF</formula>, таким образом, ток в фазе "%S" равен нулю: <formula>I_%S=0</formula>. '+
                                'Токи в двух других фазах остаются такими же как до обрыва фазы "%S" вследствие того, что линейные, а следовательно и фазные напряжения не изменяются';

  vUkrList.Values['BadLin#1'] := 'При обриві лінійного проводу «%S» для схеми «трикутник» трьохфазне коло перетворюється на двохфазне';
  vRusList.Values['BadLin#1'] := 'При обрыве линейного провода «%S» для схемы «треугольник» трехфазная цепь вырождается в двухфазную';


  vUkrList.Values['BadLin#2'] := 'Еквівалентний опір гілки <formula>%s</formula> в комплексному вигляді в алгебраїчній та показниковій формах';
  vRusList.Values['BadLin#2'] := 'Эквивалентное сопротивление ветви <formula>%s</formula> в комплексном виде в алгебраической и показательной формах';

  vUkrList.Values['BadLin#3'] := 'Напруга в колі в комплексному вигляді в показниковій формі';
  vRusList.Values['BadLin#3'] := 'Напряжение цепи в комплексном виде в показательной форме';
  end.
