unit uLocalize;
// Модуль для локализации текстов сообщений

interface


implementation
uses uLocalizeShared;

initialization

vUkrList.Values['Part'] := '%d вітка: ';
vRusList.Values['Part'] := '%d ветка: ';

vUkrList.Values['Task'] := 'Знайти:';
vRusList.Values['Task'] := 'Найти:';

vUkrList.Values['Header#1'] :=
  'Дана електрична схема представляє собою паралельне з’єднання %d віток. Напруга на них однакова і рівна напрузі на вході електричнного кола';
vRusList.Values['Header#1'] :=
  'Данная электрическая схема представляет собой параллельное соединение %d веток. Напряжение на них одинаково и равно напряжению на входе электрической цепи';
vUkrList.Values['Header#2'] := 'Циклічна частота змінної напруги ';
vRusList.Values['Header#2'] := 'Циклическая частота переменного напряжения ';

vUkrList.Values['Module1#0'] := 'Визначимо опори катушок індуктивності та конденсаторів';
vRusList.Values['Module1#0'] := 'Определим сопротивления катушек индуктивности и конденсаторов';
vUkrList.Values['Module1#1'] := 'Визначимо повний опір (імпеданс) кожної з паралельних віток';
vRusList.Values['Module1#1'] := 'Определим общее сопротивление (импеданс) каждой из параллельных веток';

vUkrList.Values['Module2#1'] := 'Визначимо зсув фаз між напругою і струмом  для кожної із паралельних віток за синусом, щоб уникнути втрати знаку кута';
vRusList.Values['Module2#1'] := 'Определим смещение фаз между напряжением и током для каждой из параллельных веток по синусу, чтобы избежать потери знака угла';
vUkrList.Values['Module2#2'] := 'Як бачимо, ';
vRusList.Values['Module2#2'] := 'Как видим, ';
vUkrList.Values['Module2#3'] := 'Це означає, що в %d вітці навантаження має';
vRusList.Values['Module2#3'] := 'Это означает, что в %d ветке нагрузка имеет';
vUkrList.Values['Module2#3_90'] := 'реактивний індуктивний';
vRusList.Values['Module2#3_90'] := 'реактивный индуктивный';
vUkrList.Values['Module2#3_90_1'] := ' характер. Струм відстає від напруги по фазі, рівній ';
vRusList.Values['Module2#3_90_1'] := ' характер. Ток отстает от напряжения по фазе, равной ';
vUkrList.Values['Module2#3_-90'] := 'реактивний ємнісний';
vRusList.Values['Module2#3_-90'] := 'реактивный ёмкостный';
vUkrList.Values['Module2#3_-90_1'] := ' характер. Струм випереджає напругу по фазі на ';
vRusList.Values['Module2#3_-90_1'] := ' характер. Ток опережает напряжение по фазе на ';
vUkrList.Values['Module2#3_0'] := 'активний';
vRusList.Values['Module2#3_0'] := 'активный';
vUkrList.Values['Module2#3_0_1'] := ' характер. Струм співпадає з напругою по фазі.';
vRusList.Values['Module2#3_0_1'] := ' характер. Ток совпадает с напряжением по фазе.';
vUkrList.Values['Module2#3_>0'] := 'активно-індуктивний';
vRusList.Values['Module2#3_>0'] := 'активно-индуктивный';
vUkrList.Values['Module2#3_>0_1'] := ' характер. Струм відстає від напруги на кут ';
vRusList.Values['Module2#3_>0_1'] := ' характер. Ток отстает от напряжения на угол ';
vUkrList.Values['Module2#3_<0'] := 'активно-ємнісний';
vRusList.Values['Module2#3_<0'] := 'активно-ёмкостный';
vUkrList.Values['Module2#3_<0_1'] := ' характер. Струм випереджає напругу на кут ';
vRusList.Values['Module2#3_<0_1'] := ' характер. Ток опережает напряжение на угол ';

vUkrList.Values['FindI#0'] := 'Знаходимо струм у гілках, використавши додатковий параметр ';
vRusList.Values['FindI#0'] := 'Находим ток в ветках, используя дополнительный параметр ';
vUkrList.Values['FindI#1'] := ', звідки ';
vRusList.Values['FindI#1'] := ', откуда';
vUkrList.Values['FindI#2'] := 'Знаходимо напругу в гілках';
vRusList.Values['FindI#2'] := 'находим напряжение в ветках';
vUkrList.Values['FindI#3'] := 'Знаходимо струм в інших гілках схеми';
vRusList.Values['FindI#3'] := 'Находим ток в остальных ветках схемы';
vUkrList.Values['FindI#31'] := 'Використовуючи задану напругу U, знаходимо струм у гілках схеми';
vRusList.Values['FindI#31'] := 'Используя заданное напряжение U, находим ток в ветвях схемы';

vUkrList.Values['Module3#0'] := 'Знайдемо струм у нерозгалудженій ділянці кола.';
vRusList.Values['Module3#0'] := 'Найдем ток в неразветвленном участке цепи.';
vUkrList.Values['Module3#1'] := 'Визначимо активні та реактивні складові струмів у кожній вітці.';
vRusList.Values['Module3#1'] := 'Определим активные и реактивные составляющие токов в каждой ветке';
vUkrList.Values['Module3#2'] := 'Струм у нерозгалудженій ділянці кола визначається як:';
vRusList.Values['Module3#2'] := 'Ток в неразветвленном участке цепи определяется как:';
vUkrList.Values['Module3#3'] := ', або за модулем';
vRusList.Values['Module3#3'] := ', или по модулю';
vUkrList.Values['Module3#4'] := 'Зсув фаз між результуючим струмом (І) та напругою (U) визначимо за тангенсом або синусом, щоб запобігти втраті знаку';
vRusList.Values['Module3#4'] := 'Смещение фаз между результирующим током (I) и напряжением (U) определим по тангенсу или синусу, чтобы предотвратить потерю знака';
vUkrList.Values['Module3#5'] := 'Як бачимо, ';
vRusList.Values['Module3#5'] := 'Как видим, ';

vUkrList.Values['Module3#6_90_1'] := '. Це означає, що у загальному колі навантаження має';
vRusList.Values['Module3#6_90_1'] := '. Это означает, что в общей цепи нагрузка имеет';
vUkrList.Values['Module3#6_90_2'] := ' реактивний індуктивний';
vRusList.Values['Module3#6_90_2'] := ' реактивный индуктивный';
vUkrList.Values['Module3#6_90_3'] := ' характер. Струм відстає від напруги по фазі, на кут рівний ';
vRusList.Values['Module3#6_90_3'] := ' характер. Ток отстает от напряжения на угол, равный ';

vUkrList.Values['Module3#6_-90_1'] := '. Це означає, що у загальному колі навантаження має';
vRusList.Values['Module3#6_-90_1'] := '. Это означает, что в общей цепи нагрузка имеет';
vUkrList.Values['Module3#6_-90_2'] := ' реактивний ємнісний';
vRusList.Values['Module3#6_-90_2'] := ' реактивный ёмкостный';
vUkrList.Values['Module3#6_-90_3'] := ' характер. Струм випереджає напругу по фазі на';
vRusList.Values['Module3#6_-90_3'] := ' характер. Ток опережает напряжение по фазе на ';

vUkrList.Values['Module3#6_>0_1'] := '. Це означає, що у загальному колі переважає ';
vRusList.Values['Module3#6_>0_1'] := '. Это означает, что в общей цепи преобладает';
vUkrList.Values['Module3#6_>0_2'] := ' активно-індуктивний';
vRusList.Values['Module3#6_>0_2'] := ' активно-индуктивный';
vUkrList.Values['Module3#6_>0_3'] := ' характер навантаження. Струм відстає від напруги на кут ';
vRusList.Values['Module3#6_>0_3'] := ' характер нагрузки. Ток отстает от напряжения на угол ';

vUkrList.Values['Module3#6_<0_1'] := '. Це означає, що у загальному колі переважає';
vRusList.Values['Module3#6_<0_1'] := '. Это означает, что в общей цепи преобладает';
vUkrList.Values['Module3#6_<0_2'] := ' активно-ємнісний';
vRusList.Values['Module3#6_<0_2'] := ' активно-ёмкостный';
vUkrList.Values['Module3#6_<0_3'] := ' характер навантаження. Струм випереджає напругу на кут ';
vRusList.Values['Module3#6_<0_3'] := ' характер нагрузки. Ток опережает напряжение на угол ';

vUkrList.Values['Module3#6_0_1'] := 'Це означає, що у загальному колі навантаження має';
vRusList.Values['Module3#6_0_1'] := 'Это означает что в общей цепи нагрузка имеет';
vUkrList.Values['Module3#6_0_2'] := ' активний';
vRusList.Values['Module3#6_0_2'] := ' активный';
vUkrList.Values['Module3#6_0_3'] := ' характер навантаження. Струм співпадає з напругою по фазі.';
vRusList.Values['Module3#6_0_3'] := ' характер нагрузки. Ток совпадает с напряжением по фазе.';

vUkrList.Values['Module3#7'] := 'Коефіцієнт потужності усього кола визначається як ';
vRusList.Values['Module3#7'] := 'Коэффициент мощности всей цепи определяется как ';
vUkrList.Values['Module3#8'] := 'Сумарна активна потужність: ';
vRusList.Values['Module3#8'] := 'Суммарная активная мощность: ';
vUkrList.Values['Module3#9'] := ' Або ';
vRusList.Values['Module3#9'] := ' Или ';
vUkrList.Values['Module3#10'] := 'Сумарна реактивна потужність ';
vRusList.Values['Module3#10'] := 'Сумарная реактивная мощность ';
vUkrList.Values['Module3#11'] := 'Повна потужність у колі ';
vRusList.Values['Module3#11'] := 'Полная мощность в цепи ';
vUkrList.Values['Module3#12'] := 'Зауважимо, що повна потужність усього кола не рівна сумі повних потужностей у кожній вітці! Тобто,';
vRusList.Values['Module3#12'] := 'Отметим, что полная мощность всей цепи не равна сумме полных мощностей в каждой ветке, т.е';
vUkrList.Values['Module3#13'] := 'Струм у нерозгалудженій частині кола можна знайти простіше без розкладання струмів на складові, знаючи повну потужність кола і напругу, а саме';
vRusList.Values['Module3#13'] := 'Ток в неразветвленной части цепи можно найти проще без раскладываения токов на составляющие, зная полную мощность цепи и напряжение, а именно';

vUkrList.Values['Module6#1'] := 'Порахуємо провідність кожної паралельної вітки';
vRusList.Values['Module6#1'] := 'Рассчитаем проводимость каждой параллельной ветви';
vUkrList.Values['Module6#2'] := 'Активна провідність: ';
vRusList.Values['Module6#2'] := 'Активная проводимость: ';
vUkrList.Values['Module6#3'] := 'Реактивна провідність: ';
vRusList.Values['Module6#3'] := 'Реактивная проводимость: ';
vUkrList.Values['Module6#4'] := 'Визначимо повну провідність паралельної ділянки';
vRusList.Values['Module6#4'] := 'Определим полную проводимость параллельного участка';
vUkrList.Values['Module6#5'] := 'Визначимо еквівалентний активний і реактивний опори паралельної ділянки';
vRusList.Values['Module6#5'] := 'Определеим эквивалентные активные и реактивные сопротивления параллельного участка';
vUkrList.Values['Module6#6'] := 'Активна складова опору';
vRusList.Values['Module6#6'] := 'Активная составляющая сопротивления';
vUkrList.Values['Module6#7'] := 'Реактивна складова опору';
vRusList.Values['Module6#7'] := 'Реактивная составляющая сопротивления';
vUkrList.Values['Module6#8'] := 'Знайдемо еквівалентний опір усього кола';
vRusList.Values['Module6#8'] := 'Найдем эквивалетное сопротивление всей цепи';
vUkrList.Values['Module6#9'] := 'Або';
vRusList.Values['Module6#9'] := 'Или';

vUkrList.Values['FindIR#1'] := 'Активна потужність P у загальному колі визначається як ';
vRusList.Values['FindIR#1'] := 'Активная мощность Р в общей цепи определяется как ';
vUkrList.Values['FindIR#2'] := 'Реактивна потужність у загальному колі Q визначається як ';
vRusList.Values['FindIR#2'] := 'Реактивная мощность в обзей цепи Q определяется как ';
vUkrList.Values['FindIR#n'] := 'Звідки струм ';
vRusList.Values['FindIR#n'] := 'Откуда ток ';

vUkrList.Values['Module7#1'] := 'Знайдемо напругу на паралельних вітках';
vRusList.Values['Module7#1'] := 'Найдем напряжение на параллельных ветках';
vUkrList.Values['Module7#2'] := 'Знайдемо силу струму в кожній вітці';
vRusList.Values['Module7#2'] := 'Найдем силу тока в каждой ветке';
vUkrList.Values['Module7#3'] := 'Знайдемо кут зсуву між загальною напругою та загальною силою струму у колі. Кут зсуву знайдемо за синусом, щоб запобігти втраті знаку кута:';
vRusList.Values['Module7#3'] := 'Найдем угол смещения между общим напряжением и общей силой тока в цепи. Угол смещения найдем по синусу, чтобы предотвратить потерю знака угла';


vUkrList.Values['Graph#1'] := 'Намалюємо графіки залежностей напруги  u(t) та сили струму у кожній вітці  i(t) від часу. Для більшої наочності для порівняння графіків доцільніше намалювати залежність напруги і струму від ωt.'#13#10+
                              'Загальна напруга змінюється за законом ';
vRusList.Values['Graph#1'] := 'Нарисуем графики зависимости напряжения u(t) и силы тока в каждой ветке i(t) от времени. Для большей наглядности для сравнения графиков целесообразнее нарисовать зависимость напряжения и тока от  ωt.'#13#10+
                               'Общее напряжение изменяется по закону ';
vUkrList.Values['Graph#2'] := ', де ';
vRusList.Values['Graph#2'] := ', где ';
vUkrList.Values['Graph#21'] := ' – максимальне (амплітудне) значення напруги';
vRusList.Values['Graph#21'] := ' - максимальное (амплитудное) значение напряжения ';
vUkrList.Values['Graph#3'] := 'Струм у %d вітці ';
vRusList.Values['Graph#3'] := 'Ток в %d ветке ';
vUkrList.Values['Graph#31'] := 'Загальний струм ';
vRusList.Values['Graph#31'] := 'Общий ток ';
vUkrList.Values['Graph#4'] := ' – максимальне (амплітудне) значення сили струму у %d-й вітці.';
vRusList.Values['Graph#4'] := ' - максимальное (амплитудное) значение силы тока в %d-й ветке. ';
vUkrList.Values['Graph#41'] := ' – максимальне (амплітудне) значення сили струму.';
vRusList.Values['Graph#41'] := ' - максимальное (амплитудное) значение силы тока. ';
vUkrList.Values['Graph#5'] := 'Залежність напруги та струму  від wt';
vRusList.Values['Graph#5'] := 'Зависимость напряжения и тока от wt';
vUkrList.Values['Graph#6'] := 'Залежність струмів в гілках схеми  від wt';
vRusList.Values['Graph#6'] := 'Зависимость токов в ветвях схемы от wt';
vUkrList.Values['Graph#7'] := 'Напруга';
vRusList.Values['Graph#7'] := 'Напряжение';
vUkrList.Values['Graph#8'] := 'Струм';
vRusList.Values['Graph#8'] := 'Ток';
vUkrList.Values['Graph#9'] := 'Позначення:';
vRusList.Values['Graph#9'] := 'Обозначения:';
vUkrList.Values['Graph#10'] := 'Струм I';
vRusList.Values['Graph#10'] := 'Ток I';
vUkrList.Values['Graph#11'] := 'Загальний струм';
vRusList.Values['Graph#11'] := 'Общий ток';


vUkrList.Values['Diagram#1'] := 'Побудуємо векторну діаграму струмів та напруги';
vRusList.Values['Diagram#1'] := 'Построим векторную диаграмму токов и напряжения';

end.
