unit uLocalize;
// Модуль для локализации текстов сообщений

interface


implementation
uses uLocalizeShared;

initialization

vUkrList.Values['Part'] := 'Паралельна вітка %d: ';
vRusList.Values['Part'] := 'Параллельная ветка %d: ';

vUkrList.Values['Complex'] := 'або, в комплекному вигляді:';
vRusList.Values['Complex'] := 'или, в комплексном виде:';



vUkrList.Values['Task'] := 'Знайти:';
vRusList.Values['Task'] := 'Найти:';

vUkrList.Values['Header#1'] :=
  'Дана електрична схема представляє собою змішане з’єднання %d віток.';
vRusList.Values['Header#1'] :=
  'Данная электрическая схема представляет собой смешанное соединение %d веток.';
vUkrList.Values['Header#2'] := 'Циклічна частота змінної напруги ';
vRusList.Values['Header#2'] := 'Циклическая частота переменного напряжения ';

vUkrList.Values['Module1#0'] := 'Визначимо опори катушок індуктивності та конденсаторів';
vRusList.Values['Module1#0'] := 'Определим сопротивления катушек индуктивности и конденсаторов';
vUkrList.Values['Module1#1'] := 'Розрахуємо повний опір вітки 1 - нерозгалудженої ділянки кола:';
vRusList.Values['Module1#1'] := 'Рассчитаем полное сопротивление ветки 1 - неразветвлённого участка цепи:';
vUkrList.Values['Module1#1_'] := 'Розрахуємо повні опори паралельних віток';
vRusList.Values['Module1#1_'] := 'Рассчитаем полные сопротивления параллельных веток.';


vUkrList.Values['Module2#1'] := 'Розрахуємо зсув фаз між напругою і силою струму у нерозгалудженій ділянці кола за синусом, щоб уникнути втрати знаку кута';
vRusList.Values['Module2#1'] := 'Рассчитаем смещение фаз между напряжением и силой тока в неразветвленном участке цепи по синусу, чтобы избежать потери знака угла';
vUkrList.Values['Module2#1_'] := 'Розрахуємо кут зсуву між напругою на паралельній ділянці і силою струму у відповідній паралельній вітці кола';
vRusList.Values['Module2#1_'] := 'Рассчитаем угол между напряжением на параллельном участке и силой тока в соответствующей параллельной ветке цепи';

vUkrList.Values['Module2#2'] := 'Як бачимо, ';
vRusList.Values['Module2#2'] := 'Как видим, ';
vUkrList.Values['Module2#3'] := 'Це означає, що в %d вітці навантаження має';
vRusList.Values['Module2#3'] := 'Это означает, что в %d ветке нагрузка имеет';
vUkrList.Values['Module2#3_90'] := 'реактивний індуктивний';
vRusList.Values['Module2#3_90'] := 'реактивный индуктивный';
vUkrList.Values['Module2#3_90_1'] := ' характер. Струм відстає від напруги по фазі, рівній ';
vRusList.Values['Module2#3_90_1'] := ' характер. Ток отстает от напряжения по фазе, равной ';
vUkrList.Values['Module2#3_-90'] := 'реактивний ємнісний';
vRusList.Values['Module2#3_-90'] := 'реактивный ёмкостный';
vUkrList.Values['Module2#3_-90_1'] := ' характер. Струм випереджає напругу по фазі на ';
vRusList.Values['Module2#3_-90_1'] := ' характер. Ток опережает напряжение по фазе на ';
vUkrList.Values['Module2#3_0'] := 'активний';
vRusList.Values['Module2#3_0'] := 'активный';
vUkrList.Values['Module2#3_0_1'] := ' характер. Струм співпадає з напругою по фазі.';
vRusList.Values['Module2#3_0_1'] := ' характер. Ток совпадает с напряжением по фазе.';
vUkrList.Values['Module2#3_>0'] := 'активно-індуктивний';
vRusList.Values['Module2#3_>0'] := 'активно-индуктивный';
vUkrList.Values['Module2#3_>0_1'] := ' характер. Струм відстає від напруги на кут ';
vRusList.Values['Module2#3_>0_1'] := ' характер. Ток отстает от напряжения на угол ';
vUkrList.Values['Module2#3_<0'] := 'активно-ємнісний';
vRusList.Values['Module2#3_<0'] := 'активно-ёмкостный';
vUkrList.Values['Module2#3_<0_1'] := ' характер. Струм випереджає напругу на кут ';
vRusList.Values['Module2#3_<0_1'] := ' характер. Ток опережает напряжение на угол ';

vUkrList.Values['ModuleZ#1'] := 'Розрахуємо комплексний опір паралельних ділянок кола:';
vRusList.Values['ModuleZ#1'] := 'Рассчитаем комплексное сопротивление параллельных участков цепи:';
vUkrList.Values['ModuleZ#2'] := 'За модулем опір паралельних віток (ділянок кола):';
vRusList.Values['ModuleZ#2'] := 'По модулю сопротивление параллельных веток (участков цепи):';
vUkrList.Values['ModuleZ#3'] := 'Кут зсуву між напругою та струмом';
vRusList.Values['ModuleZ#3'] := 'Угол смещения между напряжением и током';
vUkrList.Values['ModuleZ#4'] := 'Розрахуємо загальний комплексний опір усього кола:';
vRusList.Values['ModuleZ#4'] := 'Рассчитаем общее комплексное сопротивление всей цепи:';
vUkrList.Values['ModuleZ#5'] := 'За модулем загальний опір: ';
vRusList.Values['ModuleZ#5'] := 'По модулю общее сопротивление: ';
vUkrList.Values['ModuleZ#6'] := 'Активна частина загального опору: ';
vRusList.Values['ModuleZ#6'] := 'Активная часть общего сопротивления: ';
vUkrList.Values['ModuleZ#7'] := 'Реактивна частина загального опору: ';
vRusList.Values['ModuleZ#7'] := 'Реактивная часть общего сопротивления: ';
vUkrList.Values['ModuleZ#8'] := 'Кут зсуву між загальної напругою та загальною силою струму: ';
vRusList.Values['ModuleZ#8'] := 'Угол смещения между общим напряжением и общей силой тока: ';
vUkrList.Values['ModuleZ#9'] := 'Коефіцієнт потужності усього кола: ';
vRusList.Values['ModuleZ#9'] := 'Коэффициент мощности всей цепи: ';


vUkrList.Values['IAdd#I'] := 'Діюче значення струму в вітці 1: ';
vRusList.Values['IAdd#I'] := 'Действующее значение тока в ветке 1: ';
vUkrList.Values['IAdd#I_'] := 'Діюче значення струму в паралельній вітці %d: ';
vRusList.Values['IAdd#I_'] := 'Действующее значение тока в параллельной ветке %d: ';


vUkrList.Values['IAdd#IC'] := 'В комплексному вигляді';
vRusList.Values['IAdd#IC'] := 'В комплексном виде ';
vUkrList.Values['IAdd#2'] := 'В комплексному вигляді амплітуда сили струму';
vRusList.Values['IAdd#2'] := 'В комплексном виде амплитуда силы тока';
vUkrList.Values['IAdd#3'] := 'В комплексному вигляді діюче значення сили струму в вітці %d';
vRusList.Values['IAdd#3'] := 'В комплексном виде действующее значение силы тока в ветке %d';




vUkrList.Values['FindI#0'] := 'Знаходимо струм у гілках, використавши додатковий параметр ';
vRusList.Values['FindI#0'] := 'Находим ток в ветках, используя дополнительный параметр ';
vUkrList.Values['FindI#1'] := ', звідки ';
vRusList.Values['FindI#1'] := ', откуда';
vUkrList.Values['FindI#2'] := 'Знаходимо напругу в гілках';
vRusList.Values['FindI#2'] := 'находим напряжение в ветках';
vUkrList.Values['FindI#3'] := 'Знаходимо струм в інших гілках схеми';
vRusList.Values['FindI#3'] := 'Находим ток в остальных ветках схемы';
vUkrList.Values['FindI#31'] := 'Використовуючи задану напругу U, знаходимо струм у гілках схеми';
vRusList.Values['FindI#31'] := 'Используя заданное напряжение U, находим ток в ветвях схемы';

vUkrList.Values['Module3#0'] := 'Знайдемо струм у нерозгалудженій ділянці кола.';
vRusList.Values['Module3#0'] := 'Найдем ток в неразветвленном участке цепи.';
vUkrList.Values['Module3#1'] := 'Визначимо активні та реактивні складові струмів у кожній вітці.';
vRusList.Values['Module3#1'] := 'Определим активные и реактивные составляющие токов в каждой ветке';
vUkrList.Values['Module3#2'] := 'Струм у нерозгалудженій ділянці кола визначається як:';
vRusList.Values['Module3#2'] := 'Ток в неразветвленном участке цепи определяется как:';
vUkrList.Values['Module3#3'] := ', або за модулем';
vRusList.Values['Module3#3'] := ', или по модулю';
vUkrList.Values['Module3#4'] := 'Зсув фаз між результуючим струмом (І) та напругою (U) визначимо за тангенсом або синусом, щоб запобігти втраті знаку';
vRusList.Values['Module3#4'] := 'Смещение фаз между результирующим током (I) и напряжением (U) определим по тангенсу или синусу, чтобы предотвратить потерю знака';
vUkrList.Values['Module3#5'] := 'Як бачимо, ';
vRusList.Values['Module3#5'] := 'Как видим, ';

vUkrList.Values['Module3#6_90_1'] := '. Це означає, що у загальному колі навантаження має';
vRusList.Values['Module3#6_90_1'] := '. Это означает, что в общей цепи нагрузка имеет';
vUkrList.Values['Module3#6_90_2'] := ' реактивний індуктивний';
vRusList.Values['Module3#6_90_2'] := ' реактивный индуктивный';
vUkrList.Values['Module3#6_90_3'] := ' характер. Струм відстає від напруги по фазі, на кут рівний ';
vRusList.Values['Module3#6_90_3'] := ' характер. Ток отстает от напряжения на угол, равный ';

vUkrList.Values['Module3#6_-90_1'] := '. Це означає, що у загальному колі навантаження має';
vRusList.Values['Module3#6_-90_1'] := '. Это означает, что в общей цепи нагрузка имеет';
vUkrList.Values['Module3#6_-90_2'] := ' реактивний ємнісний';
vRusList.Values['Module3#6_-90_2'] := ' реактивный ёмкостный';
vUkrList.Values['Module3#6_-90_3'] := ' характер. Струм випереджає напругу по фазі на';
vRusList.Values['Module3#6_-90_3'] := ' характер. Ток опережает напряжение по фазе на ';

vUkrList.Values['Module3#6_>0_1'] := '. Це означає, що у загальному колі переважає ';
vRusList.Values['Module3#6_>0_1'] := '. Это означает, что в общей цепи преобладает';
vUkrList.Values['Module3#6_>0_2'] := ' активно-індуктивний';
vRusList.Values['Module3#6_>0_2'] := ' активно-индуктивный';
vUkrList.Values['Module3#6_>0_3'] := ' характер навантаження. Струм відстає від напруги на кут ';
vRusList.Values['Module3#6_>0_3'] := ' характер нагрузки. Ток отстает от напряжения на угол ';

vUkrList.Values['Module3#6_<0_1'] := '. Це означає, що у загальному колі переважає';
vRusList.Values['Module3#6_<0_1'] := '. Это означает, что в общей цепи преобладает';
vUkrList.Values['Module3#6_<0_2'] := ' активно-ємнісний';
vRusList.Values['Module3#6_<0_2'] := ' активно-ёмкостный';
vUkrList.Values['Module3#6_<0_3'] := ' характер навантаження. Струм випереджає напругу на кут ';
vRusList.Values['Module3#6_<0_3'] := ' характер нагрузки. Ток опережает напряжение на угол ';

vUkrList.Values['Module3#6_0_1'] := 'Це означає, що у загальному колі навантаження має';
vRusList.Values['Module3#6_0_1'] := 'Это означает что в общей цепи нагрузка имеет';
vUkrList.Values['Module3#6_0_2'] := ' активний';
vRusList.Values['Module3#6_0_2'] := ' активный';
vUkrList.Values['Module3#6_0_3'] := ' характер навантаження. Струм співпадає з напругою по фазі.';
vRusList.Values['Module3#6_0_3'] := ' характер нагрузки. Ток совпадает с напряжением по фазе.';

vUkrList.Values['Module3#7'] := 'Коефіцієнт потужності усього кола визначається як ';
vRusList.Values['Module3#7'] := 'Коэффициент мощности всей цепи определяется как ';
vUkrList.Values['Module3#8'] := 'Сумарна активна потужність: ';
vRusList.Values['Module3#8'] := 'Суммарная активная мощность: ';
vUkrList.Values['Module3#9'] := ' Або ';
vRusList.Values['Module3#9'] := ' Или ';
vUkrList.Values['Module3#10'] := 'Сумарна реактивна потужність ';
vRusList.Values['Module3#10'] := 'Сумарная реактивная мощность ';
vUkrList.Values['Module3#11'] := 'Повна потужність у колі ';
vRusList.Values['Module3#11'] := 'Полная мощность в цепи ';
vUkrList.Values['Module3#12'] := 'Зауважимо, що повна потужність усього кола не рівна сумі повних потужностей у кожній вітці! Тобто,';
vRusList.Values['Module3#12'] := 'Отметим, что полная мощность всей цепи не равна сумме полных мощностей в каждой ветке, т.е';
vUkrList.Values['Module3#13'] := 'Струм у нерозгалудженій частині кола можна знайти простіше без розкладання струмів на складові, знаючи повну потужність кола і напругу, а саме';
vRusList.Values['Module3#13'] := 'Ток в неразветвленной части цепи можно найти проще без раскладываения токов на составляющие, зная полную мощность цепи и напряжение, а именно';

vUkrList.Values['Module61#1'] := 'Діюче значення напруги на паралельних вітках кола';
vRusList.Values['Module61#1'] := 'Действующее значение напряжения на параллельных ветках цепи';
vUkrList.Values['Module61#2'] := 'Приймемо для зручності початкову фазу напруги за нуль. Тоді комплекс цієї напруги буде:';
vRusList.Values['Module61#2'] := 'Примем для удобства начальную фазу напряжения за ноль. Тогда комплекс этого напряжения будет:';
vUkrList.Values['Module61#3'] := 'Комплекс сили струму у вітці 1:';
vRusList.Values['Module61#3'] := 'Комплекс силы тока в ветке 1:';
vUkrList.Values['Module61#4'] := 'Діючі значення струму в паралельних вітках:';
vRusList.Values['Module61#4'] := 'Действующие значения тока в параллельных ветках:';
vUkrList.Values['Module61#5'] := 'В комплексному вигляді:';
vRusList.Values['Module61#5'] := 'В комплексном виде:';

vUkrList.Values['Module62#1'] := 'Комплекс діючого значення напруги в паралельних вітках кола:';
vRusList.Values['Module62#1'] := 'Действующее значение напряжения на параллельных ветках цепи';
vUkrList.Values['Module62#2'] := 'Комплекси діючих значень струмів, що протікають у паралельних вітках: ';
vRusList.Values['Module62#2'] := 'Комплексы действующих значений токов, которые протекают в параллельных ветках:';

vUkrList.Values['Module64#1'] := 'Комплексне значення напруги на паралельних вітках однакове і визначається:';
vRusList.Values['Module64#1'] := 'Комплексное значение напряжения на параллельных ветках одинаково и определяется:';
vUkrList.Values['Module64#2'] := 'Тоді комплексне значення сили струму в нерозгалудженій ділянці - вітці 1:';
vRusList.Values['Module64#2'] := 'Тогда комплексное значение силы тока в неразветвленном участке - ветке 1:';
vUkrList.Values['Module64#3'] := 'Комплекси діючих значень струмів, що протікають у паралельних вітках: ';
vRusList.Values['Module64#3'] := 'Комплексы действующих значений токов, которые протекают в параллельных ветках:';

vUkrList.Values['Module65#1'] := 'Діюче значення напруги на паралельних вітках кола';
vRusList.Values['Module65#1'] := 'Действующее значение напряжения на параллельных ветках цепи';
vUkrList.Values['Module65#2'] := 'Приймемо для зручності початкову фазу напруги за нуль. Тоді комплекс цієї напруги буде:';
vRusList.Values['Module65#2'] := 'Примем для удобства начальную фазу напряжения за ноль. Тогда комплекс этого напряжения будет:';

vUkrList.Values['Module66#1'] := 'Комплекси діючих значень струмів, що протікають у паралельних вітках: ';
vRusList.Values['Module66#1'] := 'Комплексы действующих значений токов, которые протекают в параллельных ветках:';


vUkrList.Values['Module7#1'] := 'Розрахуємо напругу на всіх елементах кола, а також активну, реактивну та повну потужності, що споживаються усіми елементами кола';
vRusList.Values['Module7#1'] := 'Рассчитаем напряжение на всех елементах цепи, а также активную, реактивную и полную мощности, которые потребляются всеми элементами цепи';
vUkrList.Values['Module7#1_1'] := 'Напруга на вході:';
vRusList.Values['Module7#1_1'] := 'Напряжение на входе:';
vUkrList.Values['Module7#2'] := 'Нерозгалуджена вітка 1:';
vRusList.Values['Module7#2'] := 'Неразветвленная ветка 1:';
vUkrList.Values['Module7#2i'] := 'Паралельна вітка %d:';
vRusList.Values['Module7#2i'] := 'Параллельная ветка %d:';
vUkrList.Values['Module7#Ur1'] := 'напруга на опорі у нерозгалудженій вітці 1';
vRusList.Values['Module7#Ur1'] := 'напряжение на сопротивлении в неразветвленном участке 1';
vUkrList.Values['Module7#Uri'] := 'напруга на опорі у паралельній вітці %d';
vRusList.Values['Module7#Uri'] := 'напряжение на сопротивлении в параллельной ветке %d';
vUkrList.Values['Module7#Ul1'] := 'напруга на катушці у нерозгалудженій вітці 1';
vRusList.Values['Module7#Ul1'] := 'напряжение на катушке в неразветвленном участке 1';
vUkrList.Values['Module7#Uli'] := 'напруга на катушці у паралельній вітці %d';
vRusList.Values['Module7#Uli'] := 'напряжение на катушке в параллельной ветке %d';
vUkrList.Values['Module7#UC1'] := 'напруга на конденсаторі у нерозгалудженій вітці 1';
vRusList.Values['Module7#UC1'] := 'напряжение на конденсаторе в неразветвленном участке 1';
vUkrList.Values['Module7#UCi'] := 'напруга на конденсаторі у паралельній вітці %d';
vRusList.Values['Module7#UCi'] := 'напряжение на конденсаторе в параллельной ветке %d';
vUkrList.Values['Module7#U1'] := 'напруга на усій нерозгалудженій вітці 1';
vRusList.Values['Module7#U1'] := 'напряжение на всей неразветвленной ветке 1';
vUkrList.Values['Module7#UP1'] := 'активна потужність, що споживається опором у вітці 1';
vRusList.Values['Module7#UP1'] := 'активная мощность, которая потребляестся сопротивлением в ветке 1';
vUkrList.Values['Module7#UPi'] := 'активна потужність, що споживається опором у паралельній вітці %d';
vRusList.Values['Module7#UPi'] := 'активная мощность, которая потребляется сопротивлением в параллельной ветке %d';
vUkrList.Values['Module7#UQl1'] := 'реактивна потужність, що споживається катушкою у вітці 1';
vRusList.Values['Module7#UQl1'] := 'реактивная мощность, которая потребляестся катушкой в ветке 1';
vUkrList.Values['Module7#UQli'] := 'реактивна потужність, що споживається катушкою у паралельній вітці %d';
vRusList.Values['Module7#UQli'] := 'реактивная мощность, которая потребляется катушкой в параллельной ветке %d';
vUkrList.Values['Module7#UQC1'] := 'реактивна потужність, що споживається конденсатором у вітці 1';
vRusList.Values['Module7#UQC1'] := 'реактивная мощность, которая потребляестся конденсатором в ветке 1';
vUkrList.Values['Module7#UQCi'] := 'реактивна потужність, що споживається конденсатором у паралельній вітці %d';
vRusList.Values['Module7#UQCi'] := 'реактивная мощность, которая потребляется конденсатором в параллельной ветке %d';
vUkrList.Values['Module7#3'] := 'Розглянемо паралельні вітки:';
vRusList.Values['Module7#3'] := 'Рассмотрим параллельные ветки:';
vUkrList.Values['Module7#4'] := ' В - напруга на паралельних вітках';
vRusList.Values['Module7#4'] := ' В - напряжение на параллельных ветках';
vUkrList.Values['Module8#1'] := 'Перевіримо баланс потужностей';
vRusList.Values['Module8#1'] := 'Проверим баланс мощностей';
vUkrList.Values['Module8#2'] := 'Повна потужність, що виділяється джерелом напруги:';
vRusList.Values['Module8#2'] := 'Полная мощность, которая выделяется источником напряжения:';
vUkrList.Values['Module8#3'] := ' - комплексне значення загальної напруги на вході';
vRusList.Values['Module8#3'] := ' - комплексное значение общего напряжения на входе';
vUkrList.Values['Module8#4'] := ' - величина, що комплексно спряжена до струму';
vRusList.Values['Module8#4'] := ' - величина, комплексно сопряженная току';
vUkrList.Values['Module8#5'] := 'Сумарна активна потужність, що споживається в усьому колі';
vRusList.Values['Module8#5'] := 'Суммарная активная мощность, которая потребляется во всей цепи';
vUkrList.Values['Module8#6'] := 'Сумарна реактивна потужність, що споживається в усьому колі';
vRusList.Values['Module8#6'] := 'Суммарная реактивная мощность, которая потребляется во всей цепи';
vUkrList.Values['Module8#7'] := 'Як бачимо, баланс потужностей зійшовся, отже розрахунок електричної схеми виконаний вірно!';
vRusList.Values['Module8#7'] := 'Как видим, баланс мощностей сошелся, следовательно, рассчет электрической схемы выполнен верно!';

vUkrList.Values['FindIR#1'] := 'Активна потужність P у загальному колі визначається як ';
vRusList.Values['FindIR#1'] := 'Активная мощность Р в общей цепи определяется как ';
vUkrList.Values['FindIR#2'] := 'Реактивна потужність у загальному колі Q визначається як ';
vRusList.Values['FindIR#2'] := 'Реактивная мощность в обзей цепи Q определяется как ';
vUkrList.Values['FindIR#n'] := 'Звідки струм ';
vRusList.Values['FindIR#n'] := 'Откуда ток ';

vUkrList.Values['Module9#0'] := 'Запишемо миттєві значення сили струму у вітках та напруги:';
vRusList.Values['Module9#0'] := 'Запишем мнговенные значения силы тока в ветвях и напряжения:';
vUkrList.Values['Module9#1_1'] := 'Струм у нерогалудженій вітці 1:';
vRusList.Values['Module9#1_1'] := 'Ток в неразветвленной ветке 1:';
vUkrList.Values['Module9#1_i'] := 'Струм у паралельній вітці %d:';
vRusList.Values['Module9#1_i'] := 'Ток в параллельной ветке %d:';
vUkrList.Values['Module9#2'] := 'Напруга на вході';
vRusList.Values['Module9#2'] := 'Напряжение на входе';
vUkrList.Values['Module9#3'] := 'Напруга на нерозгалудженій частині кола (вітка 1):';
vRusList.Values['Module9#3'] := 'Напряжение на неразветвленной части цепи (ветвь 1)';
vUkrList.Values['Module9#4'] := 'Напруга на паралельних вітках кола:';
vRusList.Values['Module9#4'] := 'Напряжение на параллельных ветвях цепи:';


{vUkrList.Values['Module7#1'] := 'Знайдемо напругу на паралельних вітках';
vRusList.Values['Module7#1'] := 'Найдем напряжение на параллельных ветках';
vUkrList.Values['Module7#2'] := 'Знайдемо силу струму в кожній вітці';
vRusList.Values['Module7#2'] := 'Найдем силу тока в каждой ветке';
vUkrList.Values['Module7#3'] := 'Знайдемо кут зсуву між загальною напругою та загальною силою струму у колі. Кут зсуву знайдемо за синусом, щоб запобігти втраті знаку кута:';
vRusList.Values['Module7#3'] := 'Найдем угол смещения между общим напряжением и общей силой тока в цепи. Угол смещения найдем по синусу, чтобы предотвратить потерю знака угла';}


{vUkrList.Values['Graph#1'] := 'Намалюємо графіки залежностей напруги  u(t) та сили струму у кожній вітці  i(t) від часу. Для більшої наочності для порівняння графіків доцільніше намалювати залежність напруги і струму від ωt.'#13#10+
                              'Загальна напруга змінюється за законом ';
vRusList.Values['Graph#1'] := 'Нарисуем графики зависимости напряжения u(t) и силы тока в каждой ветке i(t) от времени. Для большей наглядности для сравнения графиков целесообразнее нарисовать зависимость напряжения и тока от  ωt.'#13#10+
                               'Общее напряжение изменяется по закону ';
vUkrList.Values['Graph#2'] := ', де ';
vRusList.Values['Graph#2'] := ', где ';
vUkrList.Values['Graph#21'] := ' – максимальне (амплітудне) значення напруги';
vRusList.Values['Graph#21'] := ' - максимальное (амплитудное) значение напряжения ';
vUkrList.Values['Graph#3'] := 'Струм у %d вітці ';
vRusList.Values['Graph#3'] := 'Ток в %d ветке ';
vUkrList.Values['Graph#31'] := 'Загальний струм ';
vRusList.Values['Graph#31'] := 'Общий ток ';
vUkrList.Values['Graph#4'] := ' – максимальне (амплітудне) значення сили струму у %d-й вітці.';
vRusList.Values['Graph#4'] := ' - максимальное (амплитудное) значение силы тока в %d-й ветке. ';
vUkrList.Values['Graph#41'] := ' – максимальне (амплітудне) значення сили струму.';
vRusList.Values['Graph#41'] := ' - максимальное (амплитудное) значение силы тока. ';
vUkrList.Values['Graph#5'] := 'Залежність напруги та струму  від wt';
vRusList.Values['Graph#5'] := 'Зависимость напряжения и тока от wt';
vUkrList.Values['Graph#6'] := 'Залежність струмів в гілках схеми  від wt';
vRusList.Values['Graph#6'] := 'Зависимость токов в ветвях схемы от wt';
vUkrList.Values['Graph#7'] := 'Напруга';
vRusList.Values['Graph#7'] := 'Напряжение';
vUkrList.Values['Graph#8'] := 'Струм';
vRusList.Values['Graph#8'] := 'Ток';
vUkrList.Values['Graph#9'] := 'Позначення:';
vRusList.Values['Graph#9'] := 'Обозначения:';
vUkrList.Values['Graph#10'] := 'Струм I';
vRusList.Values['Graph#10'] := 'Ток I';
vUkrList.Values['Graph#11'] := 'Загальний струм';
vRusList.Values['Graph#11'] := 'Общий ток';       }


vUkrList.Values['Diagram#1'] := 'На основі розрахованих величин побудуємо в масштабі векторно-топологічу діаграму струмів та напруг';
vRusList.Values['Diagram#1'] := 'На основании рассчитанных величин построим в масштабе векторно-топологическую диаграмму токов и напряжений';

vUkrList.Values['Diagram#2'] := 'Відкладемо на комплексній площині вектори';
vRusList.Values['Diagram#2'] := 'Отложим на комплексной плоскости вектора';

end.
